payabbhi/test/mocks/dummy_payment_capture.json

{
  "id": "pay_mUy6UYsRvIxH9Qi2",
  "object": "payment",
  "amount": 1000,
  "currency": "INR",
  "status": "captured",
  "order_id": "order_D9kQbGJAmGwJ2XMK",
  "invoice_id": "",
  "international": false,
  "method": "card",
  "description": "merchant-provided description",
  "card": "visa-debit",
  "bank": "",
  "wallet": "",
  "vpa": "",
  "customer_id": "cust_2BCT1Tvgg1gNjVPu",
  "email": "test@example.com",
  "contact": "9999999999",
  "notes": null,
  "fee": 0,
  "service_tax": 0,
  "payout_amount": 0,
  "payout_type": "",
  "settled": false,
  "settlement_id": "",
  "refunded_amount": 0,
  "refund_status": "",
  "refunds": {
    "total_count": 0,
    "object": "list",
    "data": []
  },
  "error_code": "",
  "error_description": "",
  "created_at": 1495546415,
  "virtual_account_id": "",
  "payment_page_id": ""
}
